eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MDA_StartAngleIdentF16.c
/*
 * Copyright (c) 2022 Infineon Technologies AG. All Rights Reserved.
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG, its affiliates or its licensees. If and as long as no
 * such terms of use are agreed, use of this file is subject to the Evaluation Software License Agreement distributed
 * along with this file within the software delivery package.
 *
 */

/* Module includes */
#include "Ifx_MDA_StartAngleIdentF16.h"
#include "Ifx_MDA_StartAngleIdentF16_Cfg.h"

/* Math library includes */
#include "Ifx_Math_Abs.h"
#include "Ifx_Math_DivShL.h"
#include "Ifx_Math_Mul.h"
#include "Ifx_Math_Sub.h"

/* Representing the phases */
#define IFX_MDA_STARTANGLEIDENTF16_PHASE_A               0U
#define IFX_MDA_STARTANGLEIDENTF16_NEGATIVE_PHASE_C      1U
#define IFX_MDA_STARTANGLEIDENTF16_PHASE_B               2U
#define IFX_MDA_STARTANGLEIDENTF16_NEGATIVE_PHASE_A      3U
#define IFX_MDA_STARTANGLEIDENTF16_PHASE_C               4U
#define IFX_MDA_STARTANGLEIDENTF16_NEGATIVE_PHASE_B      5U

/* Total number of phases */
#define IFX_MDA_STARTANGLEIDENTF16_N_PHASES              6U

/* Cycles where the current measurement will be performed */
#define IFX_MDA_STARTANGLEIDENTF16_MEASUREMENT_POINT1    (IFX_MDA_STARTANGLEIDENTF16_CFG_ZERO_PULSE_LENGTH_CYCLES + 1)
#define IFX_MDA_STARTANGLEIDENTF16_MEASUREMENT_POINT2                                                               \
                                                         (IFX_MDA_STARTANGLEIDENTF16_CFG_ZERO_PULSE_LENGTH_CYCLES + \
     IFX_MDA_STARTANGLEIDENTF16_CFG_POSITIVE_PULSE_LENGTH_CYCLES)

/* Positive pulse end */
#define IFX_MDA_STARTANGLEIDENTF16_POSITIVE_PULSE_END                                                               \
                                                         (IFX_MDA_STARTANGLEIDENTF16_CFG_ZERO_PULSE_LENGTH_CYCLES + \
     IFX_MDA_STARTANGLEIDENTF16_CFG_POSITIVE_PULSE_LENGTH_CYCLES)

/* Negative pulse end */
#define IFX_MDA_STARTANGLEIDENTF16_NEGATIVE_PULSE_END                                                               \
                                                         (IFX_MDA_STARTANGLEIDENTF16_CFG_ZERO_PULSE_LENGTH_CYCLES + \
     IFX_MDA_STARTANGLEIDENTF16_CFG_POSITIVE_PULSE_LENGTH_CYCLES +                                                  \
     IFX_MDA_STARTANGLEIDENTF16_CFG_NEGATIVE_PULSE_LENGTH_CYCLES)

/* Total pulse cycles */
#define IFX_MDA_STARTANGLEIDENTF16_TOTAL_PULSE_CYCLES                                                               \
                                                         (IFX_MDA_STARTANGLEIDENTF16_CFG_ZERO_PULSE_LENGTH_CYCLES + \
     IFX_MDA_STARTANGLEIDENTF16_CFG_POSITIVE_PULSE_LENGTH_CYCLES +                                                  \
     IFX_MDA_STARTANGLEIDENTF16_CFG_NEGATIVE_PULSE_LENGTH_CYCLES)

/* pi/3, Used to output the initial rotor angle */
#define IFX_MDA_STARTANGLEIDENTF16_PI_BY_3_INDEX         (IFX_MATH_PI_INDEX / 3U)

/* 0% and 100 % duty cycles */
#define IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE       (2 * IFX_MDA_STARTANGLEIDENTF16_CFG_PERIOD_TICK)
#define IFX_MDA_STARTANGLEIDENTF16_FULL_DUTY_CYCLE       (0)

/* Macros to define the component ID */
#define IFX_MDA_STARTANGLEIDENT_COMPONENTID_SOURCEID     ((uint8)Ifx_ComponentID_SourceID_infineonTechnologiesAG)
#define IFX_MDA_STARTANGLEIDENT_COMPONENTID_LIBRARYID    ((uint16)Ifx_ComponentID_LibraryID_mctrlDriveAlgorithm)
#define IFX_MDA_STARTANGLEIDENT_COMPONENTID_MODULEID     (3U)
#define IFX_MDA_STARTANGLEIDENT_COMPONENTID_COMPONENTID1 (1U)

#define IFX_MDA_STARTANGLEIDENT_COMPONENTID_COMPONENTID2 ((uint8)Ifx_ComponentID_ComponentID2_basic)

/* Macros to define the component version */
#define IFX_MDA_STARTANGLEIDENT_COMPONENTVERSION_MAJOR   (1U)
#define IFX_MDA_STARTANGLEIDENT_COMPONENTVERSION_MINOR   (3U)
#define IFX_MDA_STARTANGLEIDENT_COMPONENTVERSION_PATCH   (0U)
#define IFX_MDA_STARTANGLEIDENT_COMPONENTVERSION_T       (0U)
#define IFX_MDA_STARTANGLEIDENT_COMPONENTVERSION_REV     (0U)

/* *INDENT-OFF* */
/* Component ID */
static const Ifx_ComponentID      Ifx_MDA_StartAngleIdent_componentID = {
    .sourceID     = IFX_MDA_STARTANGLEIDENT_COMPONENTID_SOURCEID,
    .libraryID    = IFX_MDA_STARTANGLEIDENT_COMPONENTID_LIBRARYID,
    .moduleID     = IFX_MDA_STARTANGLEIDENT_COMPONENTID_MODULEID,
    .componentID1 = IFX_MDA_STARTANGLEIDENT_COMPONENTID_COMPONENTID1,
    .componentID2 = IFX_MDA_STARTANGLEIDENT_COMPONENTID_COMPONENTID2,
};

/* Component Version */
static const Ifx_ComponentVersion Ifx_MDA_StartAngleIdent_componentVersion = {
    .major = IFX_MDA_STARTANGLEIDENT_COMPONENTVERSION_MAJOR,
    .minor = IFX_MDA_STARTANGLEIDENT_COMPONENTVERSION_MINOR,
    .patch = IFX_MDA_STARTANGLEIDENT_COMPONENTVERSION_PATCH,
    .t     = IFX_MDA_STARTANGLEIDENT_COMPONENTVERSION_T,
    .rev   = IFX_MDA_STARTANGLEIDENT_COMPONENTVERSION_REV
};
/* *INDENT-ON* */

/* polyspace-begin MISRA2012:D4.14 [Justified:Low] "The caller function has to guarantee that NULL is not passed as
 * argument." */

/* Check if any fault occurred and update status variables */
static inline bool Ifx_MDA_StartAngleIdentF16_checkFaultStatus(Ifx_MDA_StartAngleIdentF16* self, Ifx_Math_Fract16
                                                               dcLinkVoltageQ15, uint8 faultReaction, bool
                                                               clearFault);

/* Implements the off state of the state machine */
static inline Ifx_MDA_StartAngleIdentF16_State Ifx_MDA_StartAngleIdentF16_stateOff(Ifx_MDA_StartAngleIdentF16* self);

/* Implements the on state of the state machine */
static inline Ifx_MDA_StartAngleIdentF16_State Ifx_MDA_StartAngleIdentF16_stateOn(Ifx_MDA_StartAngleIdentF16* self,
                                                                                  Ifx_Math_Fract16
                                                                                  dcLinkVoltageQ15,
                                                                                  Ifx_Math_Fract16          *
                                                                                  shuntCurrentsQ15,
                                                                                  bool
                                                                                  faultStatus);

/* Implements the fault state of the state machine */
static inline Ifx_MDA_StartAngleIdentF16_State Ifx_MDA_StartAngleIdentF16_stateFault(Ifx_MDA_StartAngleIdentF16* self,
                                                                                     bool faultStatus, bool
                                                                                     clearFault);

/* Calculate phase admittances for 6 phases */
static inline void Ifx_MDA_StartAngleIdentF16_calculatePhaseAdmittances(Ifx_MDA_StartAngleIdentF16* self,
                                                                        Ifx_Math_Fract16            dcLinkVoltageQ15,
                                                                        Ifx_Math_Fract16          * shuntCurrentsQ15);

/* Generates a pulse for a given phase, containing the zero, positive and negative parts */
static inline void Ifx_MDA_StartAngleIdentF16_generatePulse(Ifx_MDA_StartAngleIdentF16* self, uint8 pulseCounter,
                                                            uint8 phaseCounter);

/* Measure current in the start and end of the positive pulse */
static inline void Ifx_MDA_StartAngleIdentF16_measureCurrent(Ifx_MDA_StartAngleIdentF16* self, uint8 counter,
                                                             Ifx_Math_Fract16* shuntCurrentsQ15);

/* Measure and accumulate voltage in the positive pulse */
static inline void Ifx_MDA_StartAngleIdentF16_measureVoltage(Ifx_MDA_StartAngleIdentF16* self, uint8 counter,
                                                             Ifx_Math_Fract16 dcLinkVoltageQ15);

