eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MDA_StartAngleIdentF16.c
        /* Store voltage for the next cycle */
        self->p_previousDcLinkVoltageQ15 = dcLinkVoltageQ15;

        /* Check if difference is bigger than tolerance */
        if ((Ifx_Math_Abs_F16(voltageDifference) > voltageTolerance)
            && (self->p_faultCheckingActive == true))
        {
            /* Set the fault information status bit */
            faultVoltageFluctuation = true;

            /* 2 Check if this fault is configured for REPORTING */
            if (faultReaction >= IFX_MDA_STARTANGLEIDENTF16_FAULT_REACTION_REPORT_ONLY)
            {
                /* report the fault through the user interface */
#if (IFX_MDA_STARTANGLEIDENTF16_CFG_ENABLE_FAULT_OUT == 1)

                /* report fault source ONLY */
                if (self->p_status.voltageFluctuation == false)
                {
                    /* report the fault through the user interface */
                    IFX_MDA_STARTANGLEIDENTF16_CFG_FAULT_OUT();
                }

#endif

                /* 3 Check if this fault is configured for REACTION */
                if (faultReaction >= IFX_MDA_STARTANGLEIDENTF16_FAULT_REACTION_REPORT_REACT)
                {
                    /* set the fault status for reacting */
                    faultStatus = true;
                }
            }
        }
    }

    self->p_status.voltageFluctuation = faultVoltageFluctuation;

    return faultStatus;
}


static inline Ifx_MDA_StartAngleIdentF16_State Ifx_MDA_StartAngleIdentF16_stateOff(Ifx_MDA_StartAngleIdentF16* self)
{
    Ifx_MDA_StartAngleIdentF16_State nextState;

    if (self->p_enable == true)
    {
        /* Reset data and transition to on */
        Ifx_MDA_StartAngleIdentF16_resetData(self);
        nextState = Ifx_MDA_StartAngleIdentF16_State_on;
    }
    else
    {
        nextState = Ifx_MDA_StartAngleIdentF16_State_off;
    }

    return nextState;
}


static inline Ifx_MDA_StartAngleIdentF16_State Ifx_MDA_StartAngleIdentF16_stateOn(Ifx_MDA_StartAngleIdentF16* self,
                                                                                  Ifx_Math_Fract16
                                                                                  dcLinkVoltageQ15,
                                                                                  Ifx_Math_Fract16          *
                                                                                  shuntCurrentsQ15,
                                                                                  bool
                                                                                  faultStatus)
{
    Ifx_MDA_StartAngleIdentF16_State nextState;

    /* If fault occurred, set active short low */
    if (faultStatus == true)
    {
        Ifx_MDA_StartAngleIdentF16_setActiveShort(self, IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE);
        nextState = Ifx_MDA_StartAngleIdentF16_State_fault;
    }

    /* Module is disabled */
    else if (self->p_enable == false)
    {
        Ifx_MDA_StartAngleIdentF16_setActiveShort(self, IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE);
        nextState = Ifx_MDA_StartAngleIdentF16_State_off;
    }

    /* Module is enabled */
    else
    {
        /* Calculate admittances for the defined cycles */
        if (self->p_averageCounter < IFX_MDA_STARTANGLEIDENTF16_CFG_AVERAGING_CYCLES)
        {
            Ifx_MDA_StartAngleIdentF16_calculatePhaseAdmittances(self, dcLinkVoltageQ15, shuntCurrentsQ15);
            nextState = Ifx_MDA_StartAngleIdentF16_State_on;
        }

        /* Estimate and output the rotor position */
        else
        {
            Ifx_MDA_StartAngleIdentF16_setActiveShort(self, IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE);
            Ifx_MDA_StartAngleIdentF16_estimatePosition(self);
            nextState = Ifx_MDA_StartAngleIdentF16_State_estimationReady;
        }
    }

    return nextState;
}


static inline Ifx_MDA_StartAngleIdentF16_State Ifx_MDA_StartAngleIdentF16_stateFault(Ifx_MDA_StartAngleIdentF16* self,
                                                                                     bool faultStatus, bool
                                                                                     clearFault)
{
    Ifx_MDA_StartAngleIdentF16_State nextState;

    /* Check if a fault clear was requested and a fault didn't occur */
    if ((clearFault == true)
        && (faultStatus == false))
    {
        nextState = Ifx_MDA_StartAngleIdentF16_State_off;
    }
    else
    {
        nextState = Ifx_MDA_StartAngleIdentF16_State_fault;
    }

    return nextState;
}


static inline void Ifx_MDA_StartAngleIdentF16_calculatePhaseAdmittances(Ifx_MDA_StartAngleIdentF16* self,
                                                                        Ifx_Math_Fract16            dcLinkVoltageQ15,
                                                                        Ifx_Math_Fract16          * shuntCurrentsQ15)
{
    /* Iterate all phases */
    if (self->p_phaseCounter < IFX_MDA_STARTANGLEIDENTF16_N_PHASES)
    {
        /* Generate pulse, measure currents and accumulate voltage */
        Ifx_MDA_StartAngleIdentF16_generatePulse(self, self->p_pulseCounter, self->p_phaseCounter);

        /* Measure current */
        Ifx_MDA_StartAngleIdentF16_measureCurrent(self, self->p_pulseCounter, shuntCurrentsQ15);

        /* Measure and accumulate voltage */
        Ifx_MDA_StartAngleIdentF16_measureVoltage(self, self->p_pulseCounter, dcLinkVoltageQ15);

        if (self->p_pulseCounter < IFX_MDA_STARTANGLEIDENTF16_TOTAL_PULSE_CYCLES)
        {
            /* Increment counter */
            self->p_pulseCounter++;
        }
        else
        {
            /* Calculate current variation */
            Ifx_Math_Fract16 deltaCurrent = Ifx_Math_Abs_F16(self->p_secondCurrent - self->p_firstCurrent);
            self->p_phaseAdmittance[self->p_phaseCounter] = Ifx_Math_DivShL_F32((Ifx_Math_Fract32)deltaCurrent,
                self->p_voltageAccumulator, 15u);

            /* Reset pulse counter and voltage accumulator */
            self->p_pulseCounter       = 1;
            self->p_voltageAccumulator = 0;

            /* Increment phaseCounter */
            self->p_phaseCounter++;
        }
    }

    /* Accumulate admittances per phase */
    else
    {
        for (uint8 i = 0; i < IFX_MDA_STARTANGLEIDENTF16_N_PHASES; i++)
        {
            self->p_phaseAdmittanceAccumulator[i] += self->p_phaseAdmittance[i];
        }

