eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MDA_StartAngleIdentF16.c
        /* Reset phase counter */
        self->p_phaseCounter = 0;

        /* Increment averaging counter */
        self->p_averageCounter++;
    }
}


static inline void Ifx_MDA_StartAngleIdentF16_measureCurrent(Ifx_MDA_StartAngleIdentF16* self, uint8 counter,
                                                             Ifx_Math_Fract16* shuntCurrentsQ15)
{
    if (counter == IFX_MDA_STARTANGLEIDENTF16_MEASUREMENT_POINT1)
    {
        /* Take first measurement */
        self->p_firstCurrent = shuntCurrentsQ15[0];
    }
    else if (counter == IFX_MDA_STARTANGLEIDENTF16_MEASUREMENT_POINT2)
    {
        /* Take second measurement */
        self->p_secondCurrent = shuntCurrentsQ15[1];
    }
    else
    {
        /* No current measurement is needed */
    }
}


static inline void Ifx_MDA_StartAngleIdentF16_measureVoltage(Ifx_MDA_StartAngleIdentF16* self, uint8 counter,
                                                             Ifx_Math_Fract16 dcLinkVoltageQ15)
{
    /* Measure voltage between during positive pulse */
    if ((counter >= IFX_MDA_STARTANGLEIDENTF16_MEASUREMENT_POINT1)
        && (counter <= IFX_MDA_STARTANGLEIDENTF16_MEASUREMENT_POINT2))
    {
        self->p_voltageAccumulator += dcLinkVoltageQ15;

        /* Activate fault checking only while measuring the voltage */
        self->p_faultCheckingActive = true;
    }
    else
    {
        self->p_faultCheckingActive = false;
    }
}


/* polyspace-begin CODE-METRIC:VOCF [Justified:Low] "Language scope code metric was not considered in order to improve
 * readability." */
static inline void Ifx_MDA_StartAngleIdentF16_generatePulse(Ifx_MDA_StartAngleIdentF16* self, uint8 pulseCounter,
                                                            uint8 phaseCounter)
{
    uint16 compareValues_tick[3];

    /* Apply patterns to generate positive pulse */
    if ((pulseCounter >= IFX_MDA_STARTANGLEIDENTF16_CFG_ZERO_PULSE_LENGTH_CYCLES)
        && (pulseCounter < IFX_MDA_STARTANGLEIDENTF16_POSITIVE_PULSE_END))
    {
        Ifx_MDA_StartAngleIdentF16_generateCompares(phaseCounter, IFX_MDA_STARTANGLEIDENTF16_FULL_DUTY_CYCLE,
            IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE, compareValues_tick);
    }

    /* Apply patterns to generate negative pulse */
    else if ((pulseCounter >= IFX_MDA_STARTANGLEIDENTF16_POSITIVE_PULSE_END)
             && (pulseCounter < IFX_MDA_STARTANGLEIDENTF16_NEGATIVE_PULSE_END))
    {
        Ifx_MDA_StartAngleIdentF16_generateCompares(phaseCounter, IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE,
            IFX_MDA_STARTANGLEIDENTF16_FULL_DUTY_CYCLE, compareValues_tick);
    }

    /* Beginning and end of the pulse, set active short */
    else
    {
        /* Set the first compare values */
        for (uint8 i = 0; i < 3; i++)
        {
            compareValues_tick[i] = IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE;
        }
    }

    /* Assign compare values to the module outputs */
    Ifx_MDA_StartAngleIdentF16_assignOutputs(self, compareValues_tick);
}


/* polyspace-end CODE-METRIC:VOCF [Justified:Low] "Language scope code metric was not considered in order to improve
 * readability." */
static inline void Ifx_MDA_StartAngleIdentF16_estimatePosition(Ifx_MDA_StartAngleIdentF16* self)
{
    /* Variables to store the maximum admittance and phase where it is measured */
    Ifx_Math_Fract32 maxAdmittance = 0;
    uint8            maxPhase      = 0;

    for (uint8 i = 0; i < IFX_MDA_STARTANGLEIDENTF16_N_PHASES; i++)
    {
        /* Calculate average admittance per phase */
        Ifx_Math_Fract32 averageAdmittance = self->p_phaseAdmittanceAccumulator[i] /
                                             IFX_MDA_STARTANGLEIDENTF16_CFG_AVERAGING_CYCLES;

        /* Find the maximumAdmittance and phase where it occurs */
        if (averageAdmittance > maxAdmittance)
        {
            maxAdmittance = averageAdmittance;
            maxPhase      = i;
        }
    }

    /* Assign outputs */
    self->p_output.maxAdmittance  = maxAdmittance;
    self->p_output.estimatedAngle = maxPhase * IFX_MDA_STARTANGLEIDENTF16_PI_BY_3_INDEX;
}


/* polyspace-begin CODE-METRIC:VOCF [Justified:Low] "Language scope code metric was not considered in order to improve
 * readability." */
static inline void Ifx_MDA_StartAngleIdentF16_generateCompares(uint8 phase, uint16 pattern1, uint16 pattern2,
                                                               uint16* compareValues_tick)
{
    /* Switch for the phases */
    switch (phase)
    {
        case IFX_MDA_STARTANGLEIDENTF16_PHASE_A:
            compareValues_tick[0] = pattern1;
            compareValues_tick[1] = pattern2;
            compareValues_tick[2] = pattern2;
            break;

        case IFX_MDA_STARTANGLEIDENTF16_NEGATIVE_PHASE_A:
            compareValues_tick[0] = pattern2;
            compareValues_tick[1] = pattern1;
            compareValues_tick[2] = pattern1;
            break;

        case IFX_MDA_STARTANGLEIDENTF16_PHASE_B:
            compareValues_tick[0] = pattern2;
            compareValues_tick[1] = pattern1;
            compareValues_tick[2] = pattern2;
            break;

        case IFX_MDA_STARTANGLEIDENTF16_NEGATIVE_PHASE_B:
            compareValues_tick[0] = pattern1;
            compareValues_tick[1] = pattern2;
            compareValues_tick[2] = pattern1;
            break;

        case IFX_MDA_STARTANGLEIDENTF16_PHASE_C:
            compareValues_tick[0] = pattern2;
            compareValues_tick[1] = pattern2;
            compareValues_tick[2] = pattern1;
            break;

        case IFX_MDA_STARTANGLEIDENTF16_NEGATIVE_PHASE_C:
            compareValues_tick[0] = pattern1;
            compareValues_tick[1] = pattern1;
            compareValues_tick[2] = pattern2;
            break;

        default:
            compareValues_tick[0] = IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE;
            compareValues_tick[1] = IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE;
            compareValues_tick[2] = IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE;
            break;
    }
}


/* polyspace-end CODE-METRIC:VOCF [Justified:Low] "Language scope code metric was not considered in order to improve
 * readability." */
static inline void Ifx_MDA_StartAngleIdentF16_assignOutputs(Ifx_MDA_StartAngleIdentF16* self,
                                                            uint16                    * compareValues_tick)
{
    for (uint8 i = 0; i < 3; i++)
    {
        /* Assign compare up values */
        self->p_output.compareValues_tick[i] = compareValues_tick[i];

        /* Assign compare down values */
        self->p_output.compareValues_tick[i + 3] = IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE - compareValues_tick[i];
    }
}


static inline void Ifx_MDA_StartAngleIdentF16_setActiveShort(Ifx_MDA_StartAngleIdentF16* self, uint16
                                                             compareValue_tick)
{
    /* Set the compare up values */
    self->p_output.compareValues_tick[0] = compareValue_tick;
    self->p_output.compareValues_tick[1] = compareValue_tick;
    self->p_output.compareValues_tick[2] = compareValue_tick;

    /* Set the compare down values */
    self->p_output.compareValues_tick[3] = IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE - compareValue_tick;
    self->p_output.compareValues_tick[4] = IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE - compareValue_tick;
    self->p_output.compareValues_tick[5] = IFX_MDA_STARTANGLEIDENTF16_ZERO_DUTY_CYCLE - compareValue_tick;
}


static inline void Ifx_MDA_StartAngleIdentF16_resetData(Ifx_MDA_StartAngleIdentF16* self)
{
    /* Reset variables to store the phase admittances */
    for (uint8 i = 0; i < 6; i++)
    {
        self->p_phaseAdmittance[i]            = 0;
        self->p_phaseAdmittanceAccumulator[i] = 0;
    }

    /* Reset counters */
    self->p_pulseCounter             = 1U;
    self->p_averageCounter           = 0U;
    self->p_phaseCounter             = 0U;
    self->p_firstCurrent             = 0;
    self->p_previousDcLinkVoltageQ15 = 0;
    self->p_secondCurrent            = 0;
    self->p_voltageAccumulator       = 0;
}


/* polyspace-end MISRA2012:D4.14 [Justified:Low] "The caller function has to guarantee that NULL is not passed as
 * argument." */
